; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	thermograph0 - mode
	infrared1 - mode
	spectrograph2 - mode
	GroundStation0 - direction
	GroundStation2 - direction
	Star3 - direction
	GroundStation4 - direction
	Star5 - direction
	GroundStation6 - direction
	Star8 - direction
	GroundStation10 - direction
	GroundStation11 - direction
	Star9 - direction
	GroundStation7 - direction
	Star1 - direction
	Star12 - direction
	Phenomenon13 - direction
	Phenomenon14 - direction
)
(:init
	(supports instrument0 infrared1)
	(supports instrument0 spectrograph2)
	(calibration_target instrument0 GroundStation11)
	(calibration_target instrument0 GroundStation7)
	(calibration_target instrument0 Star1)
	(supports instrument1 spectrograph2)
	(supports instrument1 infrared1)
	(supports instrument1 thermograph0)
	(calibration_target instrument1 Star9)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation2)
	(supports instrument2 infrared1)
	(calibration_target instrument2 Star1)
	(calibration_target instrument2 GroundStation7)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation2)
)
(:goal (and
	(pointing satellite0 GroundStation4)
	(pointing satellite1 GroundStation0)
	(have_image Star12 thermograph0)
	(have_image Phenomenon13 spectrograph2)
	(have_image Phenomenon14 thermograph0)
))

)

; plan
1. (turn_to satellite0 star9 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 star9)
   goals met: 0 of 5
2. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 5
3. (calibrate satellite0 instrument1 star9)
   added: (calibrated instrument1)
   goals met: 0 of 5
4. (turn_to satellite0 phenomenon13 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 phenomenon13)
   goals met: 0 of 5
5. (take_image satellite0 phenomenon13 instrument1 spectrograph2)
   added: (have_image phenomenon13 spectrograph2)
   goals met: 1 of 5
6. (turn_to satellite0 phenomenon14 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 phenomenon14)
   goals met: 1 of 5
7. (take_image satellite0 phenomenon14 instrument1 thermograph0)
   added: (have_image phenomenon14 thermograph0)
   goals met: 2 of 5
8. (turn_to satellite0 star12 phenomenon14)
   deleted: (pointing satellite0 phenomenon14)
   added: (pointing satellite0 star12)
   goals met: 2 of 5
9. (take_image satellite0 star12 instrument1 thermograph0)
   added: (have_image star12 thermograph0)
   goals met: 3 of 5
10. (turn_to satellite0 groundstation4 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 groundstation4)
   goals met: 4 of 5
11. (turn_to satellite1 groundstation0 groundstation2)
   deleted: (pointing satellite1 groundstation2)
   added: (pointing satellite1 groundstation0)
   goals met: 5 of 5
